Dashboard/isbank/serviceRequests/TCMB/request_uat_Tcmb_Balance_Inquiry.xml

 <!-- #endpoint#http://eacrossproductservicesuat.gm.isbank.com.tr/loan-fx-tcmb-web-v1/LoanFxTcmbServiceV1#endpoint# -->
 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://isbank.com/OpSvcs/ProdSpecificOperations/Loan/LoanFxTcmb/Service/V1">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:BinarySecurityToken wsu:Id="SecurityToken-e280294f-20fa-4486-873d-eec5c6007a52" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="wsst:LTPA" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsst="http://www.ibm.com/websphere/appserver/tokentype/5.0.2">eNR/7HyDm2C1Q8v+e+h2hiYz8vTKC46ivJrloacG6V6tiZEawkezUVDOiMmmcpxbSmkCAIYnxXECZVe3iHJ00VH25HGc4wPq63eyBnXjC4mPy4fzlFnhzYRwmRsC26OIbM5qtRoEQYlgrBlNFuYUbh3wYtFrds86QgKuN7OQFsICJmgg+ua9xZZo6lrt2US1rmeufEz2UdMIz2oa5MtWhw+1PIQFr1//XgvGOKq6rXU1ug2S65OXvXC2bgeNsOeGeMuz1yFbYycGGnPC8ujMK/us/+KgJlDxNEsVN5lOGissiIyxF26DdkO/jSmd1F86DKrxqSWc4vnHip/jUqIU9tBa3tioOj3zM60WbDk0BCs=</wsse:BinarySecurityToken>
		</wsse:Security>
		<p:consumerContext xsi:type="p:BranchContextType" xmlns:p="http://isbank.com/Technical/EA/Header/Schema/V1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<lang>tr</lang>
			<consumerCode>ID</consumerCode>
			<channelCode>branch</channelCode>
			<customerContext>   
				<customer>
					<customerNumber>601</customerNumber>
					<citizenId>13171212356</citizenId>
					<name>SEMİHA</name>
					<surname>GÜÇASY</surname>
					<taxId>4120127573</taxId>
				</customer>
			</customerContext>
			<ipAddress>10.20.12.182</ipAddress>
			<workstationName>1095X002</workstationName>
			<organizationUnitCode>1095</organizationUnitCode>
		</p:consumerContext>
	</soapenv:Header>
	<soapenv:Body>
      <v1:BalanceInquiry>
         <v1:user>064</v1:user>
         <v1:tcmbBranchCode>3</v1:tcmbBranchCode>
         <v1:currencyCode>USD</v1:currencyCode>
      </v1:BalanceInquiry>
   </soapenv:Body>
   </soapenv:Envelope>